{
    "APP": {
        "LIGHT_MODE": "Heller Modus",
        "DARK_MODE": "Dunkler Modus"
    },
    "SIDENAV": {
        "TABLE_OF_CONTENTS": "Inhaltsverzeichnis",
        "GETTING_STARTED": "Erste Schritte",
        "INSTALLATION": "Installation",
        "USAGE": "Verwendung",
        "FIRST_PROGRAM": "Erstes Programm",
        "PROGRAMMING": "Programmierung",
        "VARIABLES": "Variablen",
        "OPERATORS": "Operatoren",
        "CONTROL_STRUCTURES": "Kontrollstrukturen",
        "FUNCTIONS": "Funktionen",
        "LISTS": "Listen",
        "OBJECTS": "Objekte",
        "COMMON_ERROR_MESSAGES": "Häufige Fehlermeldungen"
    },
    "MAIN": {
        "ABSTRACT": "sQeeZ ist eine moderne Skriptsprache für Benutzer, die bei ihren Programmierprojekten Wert auf Einfachheit, Leistung und Flexibilität legen. Ihre prägnante und effiziente Syntax ermöglicht es Entwicklern, sauberen, lesbaren Code zu erstellen, der ihren spezifischen Anforderungen entspricht. Die Sprache rationalisiert den Entwicklungsprozess und ermöglicht es den Benutzern, komplexe Funktionen mit größerer Effizienz zu implementieren.",
        "KEY_COMPONENTS": "Zentrale Komponenten",
        "LEXER": "Lexer",
        "PARSER": "Parser",
        "INTERPRETER": "Interpreter",
        "LANGUAGE_SERVER": "Language Server",
        "KEY_COMPONENTS_DESCRIPTION": "Schau dir die einzelnen Komponenten genauer an, um zu verstehen, welche Rolle sie spielen und wie sie sich in der sQeeZ Script-Sprache gegenseitig ergänzen!",
        "LEXER_DESCRIPTION": "Der Lexer ist die erste Komponente der sQeeZ-Engine, die für die Umwandlung der Eingabe in eine Folge sinnvoller Token verantwortlich ist. Diese Token dienen als Grundlage für die Struktur der Sprache und ermöglichen es dem Parser, Syntax und Semantik effektiv zu interpretieren. Indem der Lexer die Eingabe versteht, sorgt er dafür, dass sQeeZ seine Einfachheit und Flexibilität behält.",
        "PARSER_DESCRIPTION": "Der Parser baut auf der Ausgabe des Lexers auf, um einen abstrakten Syntaxbaum (AST) zu erstellen. Dieser Baum ist grundlegend für das Verständnis der hierarchischen Struktur des Codes und bildet die Grundlage für eine effiziente Ausführung und Manipulation der Logik des Codes.",
        "INTERPRETER_DESCRIPTION": "Der Interpreter ist der Schlüssel, um den Code lebendig werden zu lassen! Durch die Ausführung des geparsten AST macht er sQeeZ zu einem dynamischen Werkzeug, das sowohl für schnelle Scripting-Aufgaben als auch für komplexe Anwendungen eingesetzt werden kann. Hol dir sofortiges Feedback und leistungsstarke Funktionen!",
        "LANGUAGE_SERVER_DESCRIPTION": "Unser umfassender Language Server optimiert die Programmiererfahrung in IDEs wie VSCode. Mit Funktionen wie Syntaxhervorhebung, Autovervollständigung und Fehlerprüfung hast du alle Werkzeuge, die du brauchst, um in sQeeZ effizient und effektiv zu programmieren.",
        "DOCUMENTATION": "Dokumentation",
        "DOCUMENTATION_DESCRIPTION": "Entdecke diese umfassende Dokumentation, um mit sQeeZ loszulegen! Egal, ob du neu in der Sprache bist oder ein tieferes Verständnis ihrer Funktionen erlangen möchtest, du wirst wertvolle Ressourcen finden, die Folgendes abdecken",
        "GETTING_STARTED": "Erste Schritte",
        "GETTING_STARTED_DESCRIPTION": "Lerne, wie du deine Umgebung einrichtest und deinen ersten sQeeZ-Code schreibst.",
        "BASIC_FUNCTIONALITY": "Grundlegende Funktionalitäten",
        "BASIC_FUNCTIONALITY_DESCRIPTION": "Entdecke die wichtigsten Funktionen und Möglichkeiten der Sprache.",
        "SYNTAX": "Syntax",
        "SYNTAX_DESCRIPTION": "Verstehe die Syntaxregeln, die festlegen, wie du deinen Code effektiv strukturieren kannst.",
        "LEXER_SHORT_DESCRIPTION": "Lerne, wie du den Lexer nutzen kannst, um Eingaben in Token zu zerlegen.",
        "PARSER_SHORT_DESCRIPTION": "Verstehe, wie der Parser den abstrakten Syntaxbaum (AST) aus Token konstruiert.",
        "INTERPRETER_SHORT_DESCRIPTION": "Entdecke, wie der Interpreter deinen sQeeZ-Code ausführt.",
        "EXAMPLE_CODE_SNIPPETS": "Beispiel-Codeausschnitte",
        "EXAMPLE_CODE_SNIPPETS_DESCRIPTION": "Erkunde praktische Beispiele, die die Funktionen und die Syntax der Sprache in der Praxis zeigen.",
        "ERROR_MESSAGES": "Fehlermeldungen",
        "ERROR_MESSAGES_DESCRIPTION": "Mach dich mit häufigen Fehlermeldungen und ihrer Bedeutung vertraut, um die Fehlersuche in deinem Code zu erleichtern.",
        "PLAYGROUND": "Playground",
        "PLAYGROUND_DESCRIPTION_STRONG": "Probiere sQeeZ direkt in deinem Browser aus!",
        "PLAYGROUND_DESCRIPTION": "Erlebe die Leistungsfähigkeit und Einfachheit unserer modernen Skriptsprache durch den interaktiven Playground. Egal, ob du Anfänger oder erfahrener Entwickler bist, der Playground ermöglicht es dir, mühelos mit der Programmierung in sQeeZ zu experimentieren.",
        "FEATURES": "Funktionen",
        "INTERACTIVE_CODING_ENVIRONMENT": "Interaktive Programmierumgebung",
        "INTERACTIVE_CODING_ENVIRONMENT_DESCRIPTION": "Schreibe und führe deinen Code in Echtzeit aus.",
        "CODE_SNIPPETS": "Code-Ausschnitte",
        "CODE_SNIPPETS_DESCRIPTION": "Entdecke eine Sammlung von Vorlagen, die grundlegende Funktionen, Algorithmen und einige kurze Notationen vorstellen.",
        "PLAYGROUND_LINK": "Erkunde den sQeeZ-Playground",
        "CONTRIBUTE": "Werde Teil der sQeeZ-Community!",
        "CONTRIBUTE_DESCRIPTION": "Wir freuen uns, dich einzuladen, deinen Teil zu sQeeZ beizutragen! Deine Ideen und Beiträge können unsere Skriptsprache noch besser machen. So kannst du dich beteiligen:",
        "HOW_TO_CONTRIBUTE": "Wie du mitwirken kannst",
        "CREATE_ISSUE": "Wähle oder erstelle ein Issue",
        "CREATE_ISSUE_DESCRIPTION": "Wähle ein bestehendes Issue oder erstelle ein neues, an dem du arbeiten möchtest.",
        "CLONE_REPOSITORY": "Repository klonen",
        "CLONE_REPOSITORY_DESCRIPTION": "Erstelle eine eigene Kopie des Projekts.",
        "CREATE_BRANCH": "Erstelle einen Branch",
        "CREATE_BRANCH_DESCRIPTION": "Erstelle einen neuen Branch für deine Änderungen, um deine Arbeit zu organisieren.",
        "COMMIT_MESSAGES": "Schreibe präzise Commit-Nachrichten",
        "COMMIT_MESSAGES_DESCRIPTION": "Stelle sicher, dass deine Commit-Nachrichten beschreibend und prägnant sind.",
        "IDEAS": "Setze deine Ideen um",
        "IDEAS_DESCRIPTION": "Setze deine Ideen und Verbesserungen um.",
        "TESTS": "Teste deine Änderungen",
        "TESTS_DESCRIPTION": "Überprüfe, ob deine Änderungen wie erwartet funktionieren.",
        "DOCUMENTATE": "Dokumentation aktualisieren",
        "DOCUMENTATE_DESCRIPTION": "Aktualisiere die relevante Dokumentation, falls deine Änderungen die Funktionalität beeinflussen.",
        "PULL_REQUEST": "Erstelle einen Pull-Request",
        "PULL_REQUEST_DESCRIPTION": "Teile deine Beiträge mit uns!",
        "COMMUNITY": "Beteilige dich an der Community",
        "COMMUNITY_DESCRIPTION": "Stelle Fragen oder erhalte Feedback in Diskussionen oder Issues!",
        "CONTRIBUTION_LINK": "Gemeinsam bringen wir sQeeZ auf das nächste Level!"
    }
}