{
    "APP": {
        "LIGHT_MODE": "Modo Claro",
        "DARK_MODE": "Modo Oscuro"
    },
    "SIDENAV": {
        "TABLE_OF_CONTENTS": "Tabla de Contenidos",
        "GETTING_STARTED": "Empezando",
        "INSTALLATION": "Instalación",
        "USAGE": "Uso",
        "FIRST_PROGRAM": "Primer Programa",
        "PROGRAMMING": "Programación",
        "VARIABLES": "Variables",
        "OPERATORS": "Operadores",
        "CONTROL_STRUCTURES": "Estructuras de Control",
        "FUNCTIONS": "Funciones",
        "LISTS": "Listas",
        "OBJECTS": "Objetos",
        "COMMON_ERROR_MESSAGES": "Mensajes de error comunes"
    },
    "MAIN": {
        "ABSTRACT": "sQeeZ es un lenguaje de scripting moderno diseñado para usuarios que priorizan la simplicidad, potencia y flexibilidad en sus proyectos de codificación. Su sintaxis concisa y eficiente permite a los desarrolladores crear código limpio y legible que se adapta a sus necesidades específicas. El lenguaje optimiza el proceso de desarrollo, permitiendo a los usuarios implementar funcionalidades complejas con mayor eficiencia.",
        "KEY_COMPONENTS": "Componentes Clave",
        "LEXER": "Lexer",
        "PARSER": "Parser",
        "INTERPRETER": "Interpreter",
        "LANGUAGE_SERVER": "Language Server",
        "KEY_COMPONENTS_DESCRIPTION": "¡No dudes en explorar cada componente para entender sus roles y cómo se complementan entre sí en el Lenguaje de Scripting sQeeZ!",
        "LEXER_DESCRIPTION": "El Analizador Léxico es el componente inicial del motor de sQeeZ, responsable de transformar la entrada en bruto en una secuencia de Tokens significativos. Estos tokens son la base de cómo se estructura nuestro lenguaje, permitiendo que el analizador sintáctico interprete eficazmente la sintaxis y la semántica. Al comprender la entrada, el analizador léxico asegura que sQeeZ mantenga su simplicidad y flexibilidad.",
        "PARSER_DESCRIPTION": "El Analizador Sintáctico se basa en la salida del analizador léxico para construir un Árbol de Sintaxis Abstracta (AST). Este árbol es fundamental para comprender la estructura jerárquica del código, sentando las bases para una ejecución eficiente y la manipulación de la lógica del código.",
        "INTERPRETER_DESCRIPTION": "¡El Intérprete es la clave para dar vida a tu código! Al ejecutar el AST analizado, convierte a sQeeZ en una herramienta dinámica que puede ser utilizada tanto para tareas rápidas de scripting como para aplicaciones complejas. ¡Obtén retroalimentación inmediata y una funcionalidad poderosa al alcance de tu mano!",
        "LANGUAGE_SERVER_DESCRIPTION": "Nuestro completo Servidor de Lenguaje optimiza tu experiencia de codificación en IDEs como VSCode. Con funciones como resaltado de sintaxis, autocompletado y verificación de errores, tendrás todas las herramientas que necesitas para codificar de manera eficiente y efectiva en sQeeZ.",
        "DOCUMENTATION": "Documentación",
        "DOCUMENTATION_DESCRIPTION": "¡Explora esta documentación completa para comenzar con sQeeZ! Ya seas nuevo en el lenguaje o estés buscando obtener una comprensión más profunda de sus características, encontrarás recursos valiosos que cubren",
        "GETTING_STARTED": "Primeros Pasos",
        "GETTING_STARTED_DESCRIPTION": "Aprende a configurar tu entorno y escribir tu primer código en sQeeZ.",
        "BASIC_FUNCTIONALITY": "Funcionalidad Básica",
        "BASIC_FUNCTIONALITY_DESCRIPTION": "Descubre las características y capacidades principales del lenguaje.",
        "SYNTAX": "Sintaxis",
        "SYNTAX_DESCRIPTION": "Comprende las reglas de sintaxis que definen cómo estructurar tu código de manera efectiva.",
        "LEXER_SHORT_DESCRIPTION": "Aprende cómo utilizar el analizador léxico para descomponer la entrada en tokens.",
        "PARSER_SHORT_DESCRIPTION": "Entiende cómo el analizador sintáctico construye el Árbol de Sintaxis Abstracta (AST) a partir de tokens.",
        "INTERPRETER_SHORT_DESCRIPTION": "Descubre cómo el intérprete ejecuta tu código sQeeZ.",
        "EXAMPLE_CODE_SNIPPETS": "Fragmentos de Código de Ejemplo",
        "EXAMPLE_CODE_SNIPPETS_DESCRIPTION": "Explora ejemplos prácticos que demuestran las características y la sintaxis del lenguaje en acción.",
        "ERROR_MESSAGES": "Mensajes de Error",
        "ERROR_MESSAGES_DESCRIPTION": "Familiarízate con los mensajes de error comunes y sus significados para ayudarte a depurar tu código.",
        "PLAYGROUND": "Playground",
        "PLAYGROUND_DESCRIPTION_STRONG": "¡Prueba sQeeZ directamente en tu navegador!",
        "PLAYGROUND_DESCRIPTION": "Experimenta el poder y la simplicidad de nuestro moderno lenguaje de scripting a través del playground interactivo. Ya seas un principiante o un desarrollador experimentado, el playground te permite experimentar con la codificación en sQeeZ sin esfuerzo.",
        "FEATURES": "Características",
        "INTERACTIVE_CODING_ENVIRONMENT": "Entorno de Codificación Interactivo",
        "INTERACTIVE_CODING_ENVIRONMENT_DESCRIPTION": "Escribe y ejecuta tu código en tiempo real.",
        "CODE_SNIPPETS": "Fragmentos de Código",
        "CODE_SNIPPETS_DESCRIPTION": "Explora una colección de plantillas que muestran funciones fundamentales, algoritmos y algunas notaciones breves.",
        "PLAYGROUND_LINK": "Explora el Playground de sQeeZ",
        "CONTRIBUTE": "¡Sé Parte del Viaje de sQeeZ!",
        "CONTRIBUTE_DESCRIPTION": "¡Estamos encantados de invitarte a contribuir a sQeeZ! Tus ideas y contribuciones pueden ayudar a mejorar aún más nuestro lenguaje de scripting. Aquí te explicamos cómo puedes involucrarte",
        "HOW_TO_CONTRIBUTE": "Cómo Contribuir",
        "CREATE_ISSUE": "Selecciona o Crea un Problema",
        "CREATE_ISSUE_DESCRIPTION": "Elige un problema existente o crea uno nuevo en el que quieras trabajar.",
        "CLONE_REPOSITORY": "Clona el Repositorio",
        "CLONE_REPOSITORY_DESCRIPTION": "Haz tu propia copia del proyecto.",
        "CREATE_BRANCH": "Crea una Rama",
        "CREATE_BRANCH_DESCRIPTION": "Crea una nueva rama para tus cambios y mantén tu trabajo organizado.",
        "COMMIT_MESSAGES": "Escribe Mensajes de Commit Claros",
        "COMMIT_MESSAGES_DESCRIPTION": "Asegúrate de que tus mensajes de commit sean descriptivos y concisos.",
        "IDEAS": "Haz Realidad Tus Ideas",
        "IDEAS_DESCRIPTION": "Implementa tus ideas y mejoras.",
        "TESTS": "Prueba Tus Cambios",
        "TESTS_DESCRIPTION": "Verifica que tus modificaciones funcionen como se espera.",
        "DOCUMENTATE": "Actualiza la Documentación",
        "DOCUMENTATE_DESCRIPTION": "Actualiza la documentación relevante si tus cambios afectan la funcionalidad.",
        "PULL_REQUEST": "Envía un Pull Request",
        "PULL_REQUEST_DESCRIPTION": "¡Comparte tus contribuciones con nosotros!",
        "COMMUNITY": "Participa en la Comunidad",
        "COMMUNITY_DESCRIPTION": "¡Haz preguntas o busca comentarios en discusiones o problemas!",
        "CONTRIBUTION_LINK": "¡Juntos, llevemos a sQeeZ al siguiente nivel!"
    }
}