{
    "APP": {
        "LIGHT_MODE": "Mode Clair",
        "DARK_MODE": "Mode Sombre"
    },
    "SIDENAV": {
        "TABLE_OF_CONTENTS": "Table des Matières",
        "GETTING_STARTED": "Commencer",
        "INSTALLATION": "Installation",
        "USAGE": "Utilisation",
        "FIRST_PROGRAM": "Premier Programme",
        "PROGRAMMING": "Programmation",
        "VARIABLES": "Variables",
        "OPERATORS": "Opérateurs",
        "CONTROL_STRUCTURES": "Structures de Contrôle",
        "FUNCTIONS": "Fonctions",
        "LISTS": "Listes",
        "OBJECTS": "Objets",
        "COMMON_ERROR_MESSAGES": "Messages d'erreur courants"
    },
    "MAIN": {
        "ABSTRACT": "sQeeZ est un langage de script moderne conçu pour les utilisateurs qui privilégient la simplicité, la puissance et la flexibilité dans leurs projets de programmation. Sa syntaxe concise et efficace permet aux développeurs de créer du code clair et lisible qui répond à leurs besoins spécifiques. Le langage simplifie le processus de développement, permettant aux utilisateurs d'implémenter des fonctionnalités complexes avec une plus grande efficacité.",
        "KEY_COMPONENTS": "Composants Clés",
        "LEXER": "Analyseur Lexical",
        "PARSER": "Analyseur Syntaxique",
        "INTERPRETER": "Interpréteur",
        "LANGUAGE_SERVER": "Serveur de Langage",
        "KEY_COMPONENTS_DESCRIPTION": "N'hésitez pas à explorer chaque composant pour mieux comprendre leurs rôles et comment ils se complètent dans le langage de script sQeeZ !",
        "LEXER_DESCRIPTION": "L'Analyseur Lexical est le premier composant du moteur sQeeZ, chargé de transformer l'entrée brute en une séquence de jetons (tokens) significatifs. Ces jetons servent de base à la structure du langage, permettant à l'analyseur syntaxique d'interpréter efficacement la syntaxe et la sémantique. En comprenant l'entrée, l'analyseur lexical garantit que sQeeZ conserve sa simplicité et sa flexibilité.",
        "PARSER_DESCRIPTION": "L'Analyseur Syntaxique construit à partir de la sortie de l'analyseur lexical un arbre de syntaxe abstrait (AST). Cet arbre est fondamental pour comprendre la structure hiérarchique du code, posant les bases pour une exécution et une manipulation efficaces de la logique du code.",
        "INTERPRETER_DESCRIPTION": "L'Interpréteur est la clé pour donner vie à votre code ! En exécutant l'AST analysé, il fait de sQeeZ un outil dynamique utilisable aussi bien pour des tâches de script rapide que pour des applications complexes. Obtenez un retour immédiat et une fonctionnalité puissante à portée de main !",
        "LANGUAGE_SERVER_DESCRIPTION": "Notre serveur de langage complet optimise votre expérience de codage dans des environnements tels que VSCode. Avec des fonctionnalités comme la coloration syntaxique, l'auto-complétion et la vérification des erreurs, vous disposez de tous les outils nécessaires pour coder efficacement en sQeeZ.",
        "DOCUMENTATION": "Documentation",
        "DOCUMENTATION_DESCRIPTION": "Explorez cette documentation complète pour commencer avec sQeeZ ! Que vous soyez novice dans le langage ou que vous cherchiez à approfondir votre compréhension de ses fonctionnalités, vous trouverez des ressources précieuses couvrant",
        "GETTING_STARTED": "Premiers Pas",
        "GETTING_STARTED_DESCRIPTION": "Apprenez à configurer votre environnement et à écrire votre premier code sQeeZ.",
        "BASIC_FUNCTIONALITY": "Fonctionnalités de Base",
        "BASIC_FUNCTIONALITY_DESCRIPTION": "Découvrez les fonctionnalités et capacités principales du langage.",
        "SYNTAX": "Syntaxe",
        "SYNTAX_DESCRIPTION": "Comprenez les règles de syntaxe qui définissent comment structurer efficacement votre code.",
        "LEXER_SHORT_DESCRIPTION": "Apprenez à utiliser l'analyseur lexical pour décomposer l'entrée en jetons.",
        "PARSER_SHORT_DESCRIPTION": "Comprenez comment l'analyseur syntaxique construit l'arbre de syntaxe abstrait (AST) à partir des jetons.",
        "INTERPRETER_SHORT_DESCRIPTION": "Découvrez comment l'interpréteur exécute votre code sQeeZ.",
        "EXAMPLE_CODE_SNIPPETS": "Exemples de Code",
        "EXAMPLE_CODE_SNIPPETS_DESCRIPTION": "Explorez des exemples pratiques montrant les fonctionnalités et la syntaxe du langage en action.",
        "ERROR_MESSAGES": "Messages d'Erreur",
        "ERROR_MESSAGES_DESCRIPTION": "Familiarisez-vous avec les messages d'erreur courants et leurs significations pour vous aider à déboguer votre code.",
        "PLAYGROUND": "Playground",
        "PLAYGROUND_DESCRIPTION_STRONG": "Essayez sQeeZ directement dans votre navigateur !",
        "PLAYGROUND_DESCRIPTION": "Découvrez la puissance et la simplicité de notre langage de script moderne grâce au playground interactif. Que vous soyez débutant ou développeur expérimenté, le playground vous permet d'expérimenter facilement le codage en sQeeZ.",
        "FEATURES": "Fonctionnalités",
        "INTERACTIVE_CODING_ENVIRONMENT": "Environnement de Codage Interactif",
        "INTERACTIVE_CODING_ENVIRONMENT_DESCRIPTION": "Écrivez et exécutez votre code en temps réel.",
        "CODE_SNIPPETS": "Extraits de Code",
        "CODE_SNIPPETS_DESCRIPTION": "Explorez une collection de modèles montrant des fonctions fondamentales, des algorithmes et quelques notations courtes.",
        "PLAYGROUND_LINK": "Explorez le Playground sQeeZ",
        "CONTRIBUTE": "Devenez Part de l'Aventure sQeeZ !",
        "CONTRIBUTE_DESCRIPTION": "Nous sommes ravis de vous inviter à contribuer à sQeeZ ! Vos idées et vos contributions peuvent aider à rendre notre langage de script encore meilleur. Voici comment vous pouvez vous impliquer",
        "HOW_TO_CONTRIBUTE": "Comment Contribuer",
        "CREATE_ISSUE": "Sélectionner ou Créer un Problème",
        "CREATE_ISSUE_DESCRIPTION": "Choisissez un problème existant ou créez-en un nouveau sur lequel vous souhaitez travailler.",
        "CLONE_REPOSITORY": "Cloner le Référentiel",
        "CLONE_REPOSITORY_DESCRIPTION": "Faites votre propre copie du projet.",
        "CREATE_BRANCH": "Créer une Branche",
        "CREATE_BRANCH_DESCRIPTION": "Créez une nouvelle branche pour vos changements afin de garder votre travail organisé.",
        "COMMIT_MESSAGES": "Rédigez des Messages de Commit Clairs",
        "COMMIT_MESSAGES_DESCRIPTION": "Assurez-vous que vos messages de commit sont descriptifs et concis.",
        "IDEAS": "Donnez Vie à Vos Idées",
        "IDEAS_DESCRIPTION": "Mettez en œuvre vos idées et améliorations.",
        "TESTS": "Testez Vos Modifications",
        "TESTS_DESCRIPTION": "Vérifiez que vos modifications fonctionnent comme prévu.",
        "DOCUMENTATE": "Mettez à Jour la Documentation",
        "DOCUMENTATE_DESCRIPTION": "Mettez à jour toute documentation pertinente si vos changements affectent les fonctionnalités.",
        "PULL_REQUEST": "Soumettre une Pull Request",
        "PULL_REQUEST_DESCRIPTION": "Partagez vos contributions avec nous !",
        "COMMUNITY": "Interagissez avec la Communauté",
        "COMMUNITY_DESCRIPTION": "Posez des questions ou demandez des retours dans les discussions ou les problèmes !",
        "CONTRIBUTION_LINK": "Ensemble, faisons passer sQeeZ au niveau supérieur !"
    }
}