{
    "APP": {
        "LIGHT_MODE": "Light Mode",
        "DARK_MODE": "Dark Mode"
    },
    "SIDENAV": {
        "TABLE_OF_CONTENTS": "Table of Contents",
        "GETTING_STARTED": "Getting Started",
        "INSTALLATION": "Installation",
        "USAGE": "Usage",
        "FIRST_PROGRAM": "First Program",
        "PROGRAMMING": "Programming",
        "VARIABLES": "Variables",
        "OPERATORS": "Operators",
        "CONTROL_STRUCTURES": "Control Structures",
        "FUNCTIONS": "Functions",
        "LISTS": "Lists",
        "OBJECTS": "Objects",
        "COMMON_ERROR_MESSAGES": "Common Error Messages"
    },
    "MAIN": {
        "ABSTRACT": "sQeeZ is a modern scripting language designed for users who prioritize simplicity, power, and flexibility in their coding projects. Its concise and efficient syntax enables developers to create clean, readable code that meets their specific needs. The language streamlines the development process, allowing users to implement complex functionalities with greater efficiency.",
        "KEY_COMPONENTS": "Key Components",
        "LEXER": "Lexer",
        "PARSER": "Parser",
        "INTERPRETER": "Interpreter",
        "LANGUAGE_SERVER": "Language Server",
        "KEY_COMPONENTS_DESCRIPTION": "Feel free to explore each component further to understand their roles and how they complement each other in the sQeeZ Scripting Language!",
        "LEXER_DESCRIPTION": "The Lexer is the initial component of the sQeeZ engine, responsible for transforming raw input into a sequence of meaningful Tokens. These tokens serve as the basis for how our language is structured, enabling the parser to interpret syntax and semantics effectively. By understanding the input, the lexer ensures that sQeeZ maintains its simplicity and flexibility.",
        "PARSER_DESCRIPTION": "The Parser builds on the Lexer's output to construct an Abstract Syntax Tree (AST). This tree is fundamental to understanding the hierarchical structure of the code, laying the groundwork for efficient execution and manipulation of the code's logic.",
        "INTERPRETER_DESCRIPTION": "The Interpreter is the key to making your code come alive! By executing the parsed AST, it makes sQeeZ a dynamic tool that can be used for both quick scripting tasks and complex applications. Get immediate feedback and powerful functionality at your fingertips!",
        "LANGUAGE_SERVER_DESCRIPTION": "Our comprehensive Language Server optimizes your coding experience in IDEs like VSCode. With features such as syntax highlighting, auto-completion, and error checking, you'll have all the tools you need to code efficiently and effectively in sQeeZ.",
        "DOCUMENTATION": "Documentation",
        "DOCUMENTATION_DESCRIPTION": "Explore this comprehensive documentation to get started with sQeeZ! Whether you are new to the language or looking to gain a deeper understanding of its features, you will find valuable resources covering:",
        "GETTING_STARTED": "Getting Started",
        "GETTING_STARTED_DESCRIPTION": "Learn how to set up your environment and write your first sQeeZ code.",
        "BASIC_FUNCTIONALITY": "Basic Functionality",
        "BASIC_FUNCTIONALITY_DESCRIPTION": "Discover the core features and capabilities of the language.",
        "SYNTAX": "Syntax",
        "SYNTAX_DESCRIPTION": "Understand the syntax rules that define how to structure your code effectively.",
        "LEXER_SHORT_DESCRIPTION": "Learn how to utilize the lexer to break down input into tokens.",
        "PARSER_SHORT_DESCRIPTION": "Understand how the parser constructs the Abstract Syntax Tree (AST) from tokens.",
        "INTERPRETER_SHORT_DESCRIPTION": "Discover how the interpreter executes your sQeeZ code.",
        "EXAMPLE_CODE_SNIPPETS": "Example Code Snippets",
        "EXAMPLE_CODE_SNIPPETS_DESCRIPTION": "Explore practical examples demonstrating the language's features and syntax in action.",
        "ERROR_MESSAGES": "Error Messages",
        "ERROR_MESSAGES_DESCRIPTION": "Familiarize yourself with common error messages and their meanings to help debug your code.",
        "PLAYGROUND": "Playground",
        "PLAYGROUND_DESCRIPTION_STRONG": "Try out sQeeZ directly in your browser!",
        "PLAYGROUND_DESCRIPTION": "Experience the power and simplicity of our modern scripting language through the interactive playground. Whether you're a beginner or an experienced developer, the playground allows you to experiment with coding in sQeeZ effortlessly.",
        "FEATURES": "Features",
        "INTERACTIVE_CODING_ENVIRONMENT": "Interactive Coding Environment",
        "INTERACTIVE_CODING_ENVIRONMENT_DESCRIPTION": "Write and execute your code in real-time.",
        "CODE_SNIPPETS": "Code Snippets",
        "CODE_SNIPPETS_DESCRIPTION": "Explore a collection of templates showcasing fundamental functions, algorithms and some short notations.",
        "PLAYGROUND_LINK": "Explore the sQeeZ Playground",
        "CONTRIBUTE": "Become Part of the sQeeZ Journey!",
        "CONTRIBUTE_DESCRIPTION": "We're thrilled to invite you to contribute to sQeeZ! Your ideas and contributions can help make our scripting language even better. Here's how you can get involved",
        "HOW_TO_CONTRIBUTE": "How to Contribute",
        "CREATE_ISSUE": "Select or Create an Issue",
        "CREATE_ISSUE_DESCRIPTION": "Choose an existing issue or create a new one that you want to work on.",
        "CLONE_REPOSITORY": "Clone the Repository",
        "CLONE_REPOSITORY_DESCRIPTION": "Make your own copy of the project.",
        "CREATE_BRANCH": "Create a Branch",
        "CREATE_BRANCH_DESCRIPTION": "Create a new branch for your changes to keep your work organized.",
        "COMMIT_MESSAGES": "Write Clear Commit Messages",
        "COMMIT_MESSAGES_DESCRIPTION": "Ensure your commit messages are descriptive and concise.",
        "IDEAS": "Bring Your Ideas to Life",
        "IDEAS_DESCRIPTION": "Implement your ideas and improvements.",
        "TESTS": "Test Your Changes",
        "TESTS_DESCRIPTION": "Verify that your modifications work as expected.",
        "DOCUMENTATE": "Update Documentation",
        "DOCUMENTATE_DESCRIPTION": "Update any relevant documentation if your changes affect functionality.",
        "PULL_REQUEST": "Submit a Pull Request",
        "PULL_REQUEST_DESCRIPTION": "Share your contributions with us!",
        "COMMUNITY": "Engage with the Community",
        "COMMUNITY_DESCRIPTION": "Ask questions or seek feedback in discussions or issues!",
        "CONTRIBUTION_LINK": "Together, let's take sQeeZ to the next level!"
    }
}